import { Stay } from "@/types/stay";

export const staysMock: Stay[] = [
  {
    id: 1,
    title: "База отдыха «Лесная»",
    image: "/stay1.jpg",
    rating: 4.8,
    type: "База отдыха",
    location: "Озеро Тургояк",
    description: "Уютная база отдыха на берегу озера. Подходит для семейного отдыха.",

    howToGet: ["На машине 40 минут от Миасса", "Автобус №54 до остановки «Тургояк»"],
    whatToTake: ["Тёплая одежда", "Фонарик", "Аптечка"],
    whatIsThere: ["Домики", "Баня", "Пляж", "Стоянка"],

    reviews: [
      {
        id: 1,
        author: "Анна",
        rating: 5,
        text: "Очень уютное место! Обязательно приедем снова."
      },
      {
        id: 2,
        author: "Игорь",
        rating: 4,
        text: "Хороший отдых, но в выходные многовато людей."
      }
    ]
  }
];
